In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('messy_cars.csv')

In [ ]:
df.head()

        make   model    year   price   mileage   color last_service
0        NaN  Altima  2005.0  8406.0  133415.0  silver   04-03-2022
1  Chevrolet  Accord  2015.0  7399.0   98017.0   Black   2022-12-12
2     Toyota   Camry  2016.0  2789.0   56615.0     red   2023/02/07
3     TOYOTA  Altima  2007.0  8762.0  113933.0     red   10-05-2022
4     Toyota   Focus  2016.0  2473.0  138524.0   black   2023/03/21

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   make          95 non-null     object
 1   model         93 non-null     object
 2   year          97 non-null     float64
 3   price         93 non-null     float64
 4   mileage       98 non-null     float64
 5   color         96 non-null     object
 6   last_service  91 non-null     object
dtypes: float64(3), object(4)
memory usage: 5.9+ KB
None

In [ ]:
for column in df.columns:
  print(f"{column} unique values:")
  print(df[column].unique())
  print(f"{column} missing values:")
  print(df[column].isnull().sum())

make unique values:
[nan 'chevrolet' 'toyota' 'ford' 'nissan' 'honda']
make missing values:
10
model unique values:
['altima' 'accord' 'camry' 'focus' 'malibu' nan]
model missing values:
12
year unique values:
[2005. 2015. 2016. 2007. 2012. 2020. 2013. 2008.   nan 2014. 2009. 2022.
 2018. 2017. 2011. 2021. 2019. 2010. 2006.]
year missing values:
8
price unique values:
[ 8406.  7399.  2789.  8762.  2473.    nan  3866. 13513.  5001.  7393.
  7605. 13144.  5877.  8936.  5841.  8686. 13598.  4357. 14892. 12519.
 12498.  6814. 11544.  4343. 13637.  7873. 11492.  7825.  9555. 14700.
  9885. 14466.  3147.  5378. 12532.  3385.  8240. 11926. 11561. 13191.
 13916.  5820.  8475.  5229. 10279. 13473.  4180. 14217.  8363. 11921.
 11946.  6068.  3680.  9462.  4316. 11736. 13356. 11188.  5209. 14196.
  4171. 12227.  8141. 10442. 14420.  5676. 10126.  7227. 14725.  6115.
 14985.  9177.  5326.  9557.  7270.  8230.  9688. 13113.  6756.  9771.
 10143.  2762. 12626. 10223. 14010.  5103. 12851.  7832.  4169.  9072.]
price missing values:
12
mileage unique values:
[133415.  98017.  56615. 113933. 138524. 153528.  91619.  74653. 171556.
 111974. 151032. 173888.  68664. 121444.     nan 132134. 177129. 148357.
  88994.  72323.  52872. 156914. 195189.  55181.  78480. 158803.  58614.
 113770. 152751. 140210. 124532.  60921.  65042.  83234.  56303. 110586.
 143937.  78406. 128209. 181247.  56240.  58426. 138964. 198561. 169275.
  92489. 159528. 134074. 142907.  84096. 113873.  99713. 102124.  69641.
  82892. 126027. 122743. 179698.  73205.  51821.  97395.  53409. 122020.
 139287. 188124.  98915.  75549. 115507. 129292. 181516. 185635.  53125.
 147390. 174551. 133172. 189910.  76183. 145215. 151405. 169730. 148125.
 170247. 110757. 109576. 126341. 151369. 181681. 109908.  81929. 149721.
 175605.  95412. 121315.]
mileage missing values:
7
color unique values:
['silver' 'black' 'red' 'white' 'blue' nan]
color missing values:
9
last_service unique values:
['04-03-2022' '2022-12-12' '2023/02/07' '10-05-2022' '2023/03/21'
 '2022/07/17' '2023-01-13*' '2022-10-05' '2022/08/10' '2022-10-12'
 '2022.06.24' '2022/11/06' '29-10-2022' '2022/06/12' nan '27-07-2022'
 '11/28/2022' '2023.03.04' '2023-01-22' '2022-06-05*' '24/07/2022*'
 '2022-09-27' '12/13/2022' '2022-05-24' '06-05-2022*' '2022-10-07'
 '13/08/2022' '2023/03/13' '27/08/2022' '10-21-2022' '01/18/2023'
 '08-30-2022' '28/06/2022' '05/09/2022' '08-02-2022' '03/04/2022'
 '2022-09-12' '2022/09/05' '06-12-2022' '2022/08/22' '03-08-2022'
 '08/17/2022' '2023/02/04' '04-04-2022' '05-30-2022' '11-12-2022'
 '12/02/2023' '03-22-2022' '06/09/2022*' '2022.04.26' '12/19/2022'
 '12-11-2022' '09/05/2022' '2022-09-03' '2023/02/16' '2022.10.24'
 '18/06/2022' '2022/12/23' '2022/10/10' '01-07-2022' '05-03-2022'
 '2022-12-29' '2022/05/12' '01/07/2023' '10-02-2022' '26-10-2022'
 '03/22/2022' '2022.04.16' '2022.03.23*' '2022.10.30' '2022.09.01'
 '07-25-2022' '05-11-2022' '2022/09/26' '14-08-2022' '2022.08.26'
 '2022.06.16' '04-02-2022' '2022-09-29' '2022-11-03' '2022-06-08'
 '2022/08/25' '07-20-2022' '2022.05.02*']
last_service missing values:
14

In [ ]:
df = df.applymap(lambda s: s.strip().lower() if type(s) == str else s)

In [ ]:
print(df.head())

        make   model    year   price   mileage   color last_service
0        NaN  altima  2005.0  8406.0  133415.0  silver   04-03-2022
1  chevrolet  accord  2015.0  7399.0   98017.0   black   2022-12-12
2     toyota   camry  2016.0  2789.0   56615.0     red   2023/02/07
3     toyota  altima  2007.0  8762.0  113933.0     red   10-05-2022
4     toyota   focus  2016.0  2473.0  138524.0   black   2023/03/21

In [ ]:
model_to_make = {'focus': 'ford', 'accord': 'honda', 'malibu': 'cheverolet', 'altima': 'nissan', 'camry': 'toyota'}
def fill_missing_make(row):
  if pd.isnull(row['make']) and row['model'] in model_to_make:
    row['make'] = model_to_make[row['model']]
  return row
df = df.apply(fill_missing_make,axis=1)

In [ ]:
print(df.head())

        make   model    year   price   mileage   color last_service
0     nissan  altima  2005.0  8406.0  133415.0  silver   04-03-2022
1  chevrolet  accord  2015.0  7399.0   98017.0   black   2022-12-12
2     toyota   camry  2016.0  2789.0   56615.0     red   2023/02/07
3     toyota  altima  2007.0  8762.0  113933.0     red   10-05-2022
4     toyota   focus  2016.0  2473.0  138524.0   black   2023/03/21

In [ ]:
df = df[df['price'] >=0]
df = df[df['mileage']>=0]

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86 entries, 0 to 104
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   make          85 non-null     object
 1   model         75 non-null     object
 2   year          79 non-null     float64
 3   price         86 non-null     float64
 4   mileage       86 non-null     float64
 5   color         81 non-null     object
 6   last_service  77 non-null     object
dtypes: float64(3), object(4)
memory usage: 5.4+ KB
None

In [ ]:
from datetime import datetime
def standardize(date_str):
  if pd.isnull(date_str):
    return None
  date_formats = [ '%Y/%m/%d',
        '%Y.%m.%d',
        '%Y-%m-%d',
        '%d-%m-%Y',
        '%m-%d-%Y',
        '%d/%m/%Y',
        '%m/%d/%Y']
  for date_format in date_formats:
    try:
      dt = datetime.strptime(date_str, date_format)
      return dt.strftime("%Y-%m-%d")
    except ValueError:
      pass
  return None
df['last_service'] = df['last_service'].apply(standardize)

In [ ]:
print(df.head())

        make   model    year   price   mileage   color last_service
0     nissan  altima  2005.0  8406.0  133415.0  silver   2022-03-04
1  chevrolet  accord  2015.0  7399.0   98017.0   black   2022-12-12
2     toyota   camry  2016.0  2789.0   56615.0     red   2023-02-07
3     toyota  altima  2007.0  8762.0  113933.0     red   2022-05-10
4     toyota   focus  2016.0  2473.0  138524.0   black   2023-03-21

In [ ]:
import re
mystring ="678998Sh@am1in N1iazi"
letters_only = re.sub(r'[^a-zA-Z\s]','',mystring)
print(letters_only)

Shamin Niazi

In [ ]:
import re
mystring ="678998Sh@am1in N1iazi"
letters_only = re.sub(r'\D','',mystring)
print(letters_only)

67899811

In [ ]:
df.to_csv('clean_cars.csv')